package utils

const (
	BotName          = "چیل بات"
	BOT_USERNAME     = "Chill_game_bot"
	AdminID          = "x"
	EnterUserCoin    = "20"
	CompleteUserCoin = 10

	//// Regesteration:
	// Step 1:
	StartMessage = "سلام %s عزیز ✋️\n\n" +
		"به 《" + BotName + " 🤖》 خوش اومدی ، توی این ربات می تونی افراد #نزدیک ات رو پیدا کنی و باهاشون آشنا شی و یا به یه نفر بصورت #ناشناس وصل شی و باهاش #چت کنی ❗️\n\n" +
		"- استفاده از این ربات رایگانه و اطلاعات تلگرام شما مثل اسم،عکس پروفایل یا موقعیت GPS کاملا محرمانه هست😎\n" +
		"برای شروع جنسیتت رو انتخاب کن 👇"
	// Step 2:

	StartAge = "خب حالا سنت رو بهم بگو ؟:\n\n" +
		"لطفاً سن خود را وارد کنید (عدد بین 13 تا 100):"
	// Step 3:

	StartProvince = "خب حالا فقط کافیه استانت رو انتخاب کنی تا وارد ربات شیم\n\n" +
		"• استانت رو از لیست پایین 👇انتخاب کن"
	// Final Step:

	CompleteReg = "✅اطلاعات شما ثبت شد.\n\n" +
		"به خانواده بزرگ #" + BotName + " خوش اومدی بهت توصیه میکنم اول از همه با لمس کردن 《🤔 راهنما》 با ربات آشنا شی\n\n" +
		"از منوی پایین👇 انتخاب کن"

	//// Invite:

	InviteMsg1 = "《" + BotName + " 🤖》هستم،بامن میتونی\n\n" +
		"📡 افراد #نزدیک ، #هم‌سنی ، #هم‌استانی خودتو پیداکنی و باهاشون #ناشناس چت کنی و آشنا شی😍\n\n" +
		"پس منتظر چی هستی؟🤔 بدووو بیا که منتظرتم!🏃‍♂️️\n\n" +
		"همین الان روی لینک بزن  👇\n" +
		"%s\n\n" +
		"✅ #رایگان و #واقعی 😎"

	InviteMsg2 = "لینک⚡️ دعوت شما با موفقیت ساخته شد 👆\n\n" +
		"شما میتوانید بنر حاوی لینک⚡️ خود را به گـــروه ها و دوستان خود ارسال کنید\n\n" +
		"با معرفی هر نفر " + EnterUserCoin + " سکه بگیرید! برای اطلاعات بیشتر راهنمای سکه رو بخون ( /help_credit )\n\n" +
		"👈 شما تاکنون %d نفر را به این ربات دعوت کرده اید."

	//// Referal:

	ReferalEnterUser = "🎉 یک نفر از طریق لینک دعوت شما وارد چیل‌بات شد!\n\n" +
		"💰 " + EnterUserCoin + " سکه به حسابتان اضافه شد."
	// "✅ اگر این کاربر ثبت‌نام خود را کامل کند، " + string(CompleteUserCoin) + " سکه‌ی دیگر هم دریافت خواهید کرد."

	ReferalCompletionUser = "🎉 تبریک! کاربری که از طریق لینک دعوت شما وارد چیل‌بات شده بود، ثبت‌نام خود را کامل کرد.\n\n" +

		"💰 به همین خاطر ۱۰ سکه‌ی دیگر هم به حسابتان اضافه شد.\n\n" +
		"از اینکه چیل‌بات را با دوستانتان به اشتراک می‌گذارید ممنونیم! 🫶"

	//// Coin:

	FreeCoin = "💰 سکه\n\n" +
		"💰 سکه فعلی شما: %d\n\n" +
		"❓ روش های بدست آوردن سکه چیست؟\n\n" +
		"برای افزایش سکه به صورت رایگان لینک 👈 مخصوص خودت ( /link ) رو\n" +
		"برای دوستانت بفرست و " + EnterUserCoin + " سکه دریافت کن\n\n" +
		"- برای اطلاعات بیشتر راهنمای سکه رو بخون ( /help_credit )\n\n" +
		"🛒 خرید سکه بصورت آنلاین:\n\n" +
		"برای خرید سکه یکی از تعرفه های زیر را انتخاب نمایید👇"

	//// GPS:

	GpsMsg1 = "⚠️ توجه کنید : با توجه به این که پروفایل کاربران به صورت عمومی قابل مشاهده است ، در صورت رعایت نکردن قوانین زیر حساب کاربری شما بصورت دائمی مسدود خواهد شد.\n\n" +
		"1️⃣ هرگونه محتوای غیر اخلاقی یا توهین آمیز در پروفایل ( عکس یا متن )\n\n" +
		"2️⃣ پخش شماره موبایل یا اطلاعات شخصی دیگران\n\n" +
		"3️⃣ تبلیغات کانال ، ربات و یا سایت\n\n" +
		"👇👇👇"

	GpsMsg2 = "⚠️ هنگام ارسال موقعیت مکانی مطمعن شوید GPS موبایل شما روشن است.\n\n" +
		"✅ کسی قادر به دیدن موقعیت مکانی شما در ربات نخواهد بود و فقط برای تخمین فاصله و یافتن افراد نزدیک کاربرد خواهد داشت\n\n" +
		"❓موقعیت GPS خود را ارسال کنید👇"

	//// Profile

	UpdateSuccessful = "با موفقیت انجام شد ✅\n\n" +
		"خب ، حالا چه کاری برات انجام بدم؟\n\n" +
		"از منوی پایین👇 انتخاب کن"

	//// Help

	HelpMsg = "🔹راهنمای استفاده از ربات:\n\n" +
		"من اینجام که کمکت کنم! برای دریافت راهنمایی در مورد هر موضوع، کافیه دستور آبی رنگی که مقابل اون سوال هست رو لمس کنی:\n\n" +
		"⁉️ چگونه بصورت ناشناس چت کنم؟ /help_chat\n\n" +
		"⁉️ سکه یا امتیاز چیست؟ /help_credit\n\n" +
		"️⁉️ چگونه افراد نزدیکمو پیدا کنم؟ /help_gps\n\n" +
		"⁉️ پروفایل چیست؟ /help_profile\n\n" +
		"⁉️ چگونه درخواست چت بفرستم؟ /help_sendchat\n\n" +
		"⁉️ پیام دایرکت چیست؟ /help_direct\n\n" +
		"⁉️ چگونه با 'میان بر' ها کار کنم؟ /help_shortcuts\n\n" +
		"⁉️ اطلاع رسانی آنلاین شدن مخاطب /help_onw\n\n" +
		"⁉️ اطلاع رسانی اتمام چت مخاطب /help_chw\n\n" +
		"⁉️ لیست مخاطبین چیست ؟ /help_contacts\n\n" +
		"⁉️ چگونه بصورت پیشرفته بین کاربران جستجو کنم ؟ /help_search\n\n" +
		"⁉️ آموزش حذف پیام در چت /help_deleteMessage\n\n" +
		"⚖️ قوانین استفاده از ربات /ghavanin\n\n" +
		"👨‍💻 ارتباط با پشتیبانی ربات: @" + AdminID

	HelpChat = "🔹برای چت میتونی یکی از راه های زیر رو انتخاب کنی:\n\n" +
		"⚜️ جستجوی تصادفی رو از بخش شروع چت انتخاب کنی و به صورت تصادفی به یکی وصل بشی! (بدون نیاز به سکه)\n\n" +
		"⚜️ جستجو بر اساس جنسیت مورد نظر رو از بخش شروع چت انتخاب کنی و به یکی وصل بشی (نیاز به 2 سکه)\n\n" +
		"⚜️ جستجو براساس شهر مورد نظر رو از بخش شروع چت انتخاب کنی و به انتخاب خودت به یکی وصل بشی\n\n⚜️" +
		"جستجو براساس موضوع مورد نظر ، از بخش شروع چت گزینه چت روم اختصاصی رو انتخاب کنی و براساس موضوع موردنظر و به انتخاب خودت به یکی وصل بشی\n\n" +
		"⚠️ اطلاعات شخصی شما مثل موقعیت GPS یا اسم شما در تلگرام یا عکس پروفایل و.. کاملا مخفی هست و فقط اطلاعاتی که تو ربات ثبت میکنید مانند شهر و عکس(توی ربات) برای کاربرای ربات قابل مشاهده هست.\n\n" +
		"🔸 - راهنما : /help"

	HelpCredit = "🔹سکه یا امتیاز چیست؟\n\n" +
		"شما با داشتن سکه میتوانید :\n\n" +
		"- پیام دایرکت بفرستید (1سکه)\n" +
		"- درخواست چت بفرستید(2سکه)\n" +
		"- از جستجوی پسر  یا جستجوی دختر  استفاده کنید(2سکه)\n" +
		"- از ـ«به محض آنلاین شدن اطلاع بده» استفاده کنید(1سکه)\n" +
		"- از ـ«به محض اتمام چت به من اطلاع بده» استفاده کنید(1سکه)\n\n" +
		"📢 توجه: سکه فقط در صورتی کسر می شود که درخواست موفق باشد ( مثلا درخواست چت شما توسط کاربر مقابل پذیرفته شود )\n\n" +
		"❓روش بدست آوردن سکه چیست؟\n\n" +
		"1️⃣ معرفی دوستان (رایگان) :\n" +
		"برای افزایش سکه به صورت رایگان بنر لینک⚡️ مخصوص خودت (/link) رو برای دوستات بفرست و 20 سکه دریافت کن\n\n" +
		"2️⃣ خرید سکه بصورت آنلاین\n\n" +
		"3️⃣ معرفی کاربران متخلف :\n" +
		"با معرفی کردن افرادی که قوانین ربات رو رعایت نمیکنند 5 سکه هدیه بگیر 😍\n\n" +
		"⚠️ 5 سکه بابت گزارش تخلف پس از بررسی گزارش و صحیح بودن آن اضافه خواهد شد و گزارش تخلف حتما باید توضیحات داشته باشد.\n\n" +
		"💡 برای گزارش تخلف کاربر گزینه ی «🚫 گزارش کاربر» رو روی پروفایلش لمس کن.\n\n" +
		"- به ازای هرنفری که با لینک⚡️ شما وارد ربات میشه به محض ورود 7 تا سکه رایگان دریافت میکنی و بعد از اینکه اطلاعات پروفایــــــلش رو کامل کرد 8 تا سکه دیگه و به محض اینکه کاربر ربات رو به دیگران معرفی کرد 5 تا سکه رایگان دیگه هم دریافت میکنی😎 (20=5+8+7)\n\n" +
		"🔸 - راهنما : /help"

	HelpGps = "🔹چگونه افراد نزدیکمو پیدا کنم؟\n\n" +
		"برای دیدن لیست افراد نزدیکت فقط کافیه 《📍پیدا کردن افراد نزدیک با GPS》 رو لمس کنی.\n\n" +
		"- جستجوی افراد نزدیک کاملا رایگان هست (بدون نیاز به سکه)\n\n" +
		"برای مشاهده کردن و یا چت کردن با افراد نزدیکت کافیه توی لیست روی آیدی شون بزنی تا پروفایلشونو ببینی.\n\n" +
		"📢 توجه: امکان مشاهده موقعیت کاربران وجود ندارد و فقط فاصله آنها نمایش داده می شود.\n\n" +
		"🔸 - راهنما : /help"

	HelpProfile = "🔹پروفایل چیست؟\n\n" +
		"⚜️برای دیدن پروفایل خودت کافیه 《👤 پروفایل》 رو لمس کنی.\n" +
		"⚜️برای دیدن پروفایل کسی که باهاش چت میکنی کافیه ایدی کاربری که باهاش چت میکنی رو لمس کنی.\n\n" +
		"⚜️برای دیدن پروفایل هرکاربر کافیه روی آیدیش تو ربات بزنی.\n\n" +
		"📢 آیدی چیست؟ کد اختصاصی هر کاربر که با زدن آن پروفایل کاربر نمایش داده میشود و به صورت /user_ است.\n\n" +
		"- پروفایل هر کاربر شامل اطلاعاتی که تو ربات ثبت کرده (نام،سن،جنسیت،شهر،عکس) و تاریخ حضورش تو ربات و فاصلش با شما میشه.\n\n" +
		"برای ارسال پیام دایرکت یا درخواست چت برای هر کاربر ابتدا باید پروفایلش رو مشاهده کنی و سپس دکمه ارسال پیام دایرکت یا درخواست چت رو بزنی.\n\n" +
		"🔸 - راهنما : /help"

	HelpSendchat = "🔹چگونه درخواست چت بفرستم؟\n\n" +
		"برای ارسال درخواست چت به کاربران باید گزینه 《💬 درخواست چت》 رو در پروفایل کاربر لمس کنی.\n\n" +
		"- با ارسال درخواست چت تا وقتی که تایید نشده ازتون سکه ای کم نمیشه،درخواست چت وصل شد 2 سکه ازتون کم میشه.\n\n" +
		"📢 توجه: امکان ارسال درخواست چت فقط برای کاربرانی که در 15 دقیقه اخیر آنلاین بوده اند وجود دارد.\n\n" +
		"🔸 - راهنما : /help"

	HelpDirect = "🔹پیام دایرکت چیست؟\n\n" +
		"با پیام دایرکت میتونی بصورت آنی به کاربر پیام متنی ارسال بکنی حتی اگه درحال چت کردن باشه !\n\n" +
		"فقط کافیه وقتی پروفایل کاربر رو مشاهده میکنی روی گزینه 《📨 پیام دایرکت》 بزنی و متن پیامتو بفرستی.\n\n" +
		"- درصورت ارسال پیام دایرکت 1 سکه ازت کم میشه\n" +
		"- این پیام همون لحظه ارسال میشه و بعدا تو ربات آرشیو نمیشه.\n\n" +
		"📢 توجه: متن پیام حداکثر میتونه 200 حرف باشه و اگه متنی که ارسال میکنی بیشتر از 200 حرف بود فقط 200 حرف اولش ارسال میشه.\n\n" +
		"💥 قابلیت ویژه پیام دایرکت : درصورتی که کاربر دریافت کننده ، ربات را بلاک کرده باشد پیام دایرکت به محض آنبلاک شدن کاربر به او ارسال میگردد تا حتما پیام دایرکت را مشاهده کند.\n\n" +
		"🔸 - راهنما : /help"

	HelpShortcuts = "🔹 چگونه با \"میان بر\" ها کار کنم؟\n\n" +
		"میانبر به شما امکان استفاده آسان و سریع از ربات رو میده !\n\n" +
		"فقط کافیه وقتی توی ربات حرف 《 / 》 رو تایپ کنی تا لیست اصلی ترین میانبر ها رو ببینی.\n\n" +
		"لیست میانبر های ربات 👇\n\n" +
		"/start - ♻️ شروع از اول\n" +
		"/sr - 🎲جستجوی شانسی\n" +
		"/sg - 🙎‍♀️️جستجوی دختر\n" +
		"/sb - 🙎‍♂️️جستجوی پسر\n" +
		"/link - 💯ساخت لینک اختصاصی من\n" +
		"/profile - 👤 پروفاـــــــیل من\n" +
		"/credit -💰سکه های من\n" +
		"/help - 🤔راهنما\n" +
		"/id- مشاهده آیدی من\n\n" +
		//"💥 تو عکس پایین میتونی ببینی که با تایپ کردن حرف \"/\" توی ربات لیست اصلی ترین میانبر هارو ببینی 👇\n\n" +
		"🔸 - راهنما : /help"

	HelpOnw = "🔹 اطلاع رسانی آنلاین شدن مخاطب\n\n" +
		"با این قابلیت وقتی که کاربر مورد نظرت آنلاین شد ، بهت اطلاع رسانی میشه.\n\n" +
		"- درصورت فعال کردن این قابلیت برای هر کاربر 1 💰سکه ازت کم میشه\n" +
		"- این قابلیت یکبار فعال میشه و برای اطلاع رسانی دوباره باید یکبار دیگه فعالش کنی.\n" +
		"- اگه بعد از 10 روز کاربر مورد نظرت آنلاین نشد این قابلیت غیر فعال میشه.\n\n" +
		"🔴 برای فعال کردن این قابلیت گزینه «🔔 به محض آنلاین شدن  اطلاع بده » توی پروفایل کاربر مورد نظرت رو بزن .\n" +
		"(در صورتی که این گزینه وجود نداره یا کاربر آنلاینه و یا این قابلیت رو قبلا براش فعال کردی)\n\n" +
		"🔸 - راهنما : /help"

	HelpChw = "🔹 اطلاع رسانی اتمام چت مخاطب\n\n" +
		"با این قابلیت وقتی که کاربر مورد نظرت چتش با مخاطبش تموم بشه ، بهت اطلاع رسانی میشه.\n\n" +
		"- درصورت فعال کردن این قابلیت برای هر کاربر 1 💰سکه ازت کم میشه\n" +
		"- این قابلیت یکبار فعال میشه و برای اطلاع رسانی دوباره باید یکبار دیگه فعالش کنی.\n" +
		"- اگه بعد از 10 روز چت کاربر مورد نظرت تموم نشد این قابلیت غیر فعال میشه.\n\n" +
		"🔴 برای فعال کردن این قابلیت گزینه «🔔 به محض اتمام چت اطلاع بده » توی پروفایل کاربر مورد نظرت رو بزن .\n" +
		"(در صورتی که این گزینه وجود نداره یا کاربر درجال چت نیست و یا این قابلیت رو قبلا براش فعال کردی)\n\n" +
		"🔸 -  راهنما : /help"

	HelpContacts = "🔹   لیست مخاطبین چیست ؟\n\n" +
		"با قابلیت لیست مخاطبین می تونی مخاطب هاتو تو ربات داشته باشی و گمشون نکنی !\n\n" +
		"- برای دیدن لیست مخاطبین خودت کافیه 《👤 پروفایل》 رو از منوی ربات انتخاب کنی و «🙎‍♂️️🙎‍♀️️ لیست مخاطبین» رو لمس کنی.\n" +
		"و یا « /contacts » رو از منوی میانبر ها انتخاب کنی.\n\n" +
		"برای اضافه کردن کاربر به لیست مخاطبین گزینه «➕افزودن به مخاطبین » رو تو پروفایلش بزن.\n\n" +
		"🔸 -  راهنما : /help"

	HelpSearch = "🔹  چگونه بصورت پیشرفته بین کاربران جستجو کنم ؟\n\n" +
		"کافیه گزینه «🔍 جستجوی کاربران 🔎» رو تو منوی ربات لمس کنی و یکی از این گزینه ها رو انتخاب کنی 👇\n\n" +
		"🎌 هم استانی ها\n" +
		" - لیست کاربرانی که تو استان شما هستند.\n\n" +
		"👥 هم سن ها\n" +
		" - لیست کاربرانی که در رده سنی نزدیک شما هستند.\n\n" +
		"🚶‍♂️️ بدون چت ها 🚶‍♀️️\n" +
		" - لیست کاربرانی آنلاینی که در حال چت نیستند.\n\n" +
		"🙋‍♂️️ کاربران جدید 🙋‍♀️️\n" +
		" - لیست کاربراننی که تازه عضو ربات شده اند.\n\n" +
		"🔍 جستجوی پیشرفته 🔎\n" +
		" - جستجوی کاربران بصورت پیشرفته با فیلتر جنسیت ، رده سنی ، استان ها و افراد نزدیک ، تاریخ آخرین فعالیت در ربات و با قابلیت مرتب سازی بر اساس نزدیک بودن فاصله ، تاریخ آخرین فعالیت در ربات ، سن و نمایش کاربران بدون چ آنلاین !\n\n" +
		"استفاده از این امکانات بصورت کاملا رایگان و بدون نیاز به سکه است.\n\n" +
		"🔸 -  راهنما : /help"

	HelpDeleteMessage = "🔹  آموزش حذف پیام در چت\n\n" +
		"هر پیامی که تو چت فرستادی و میخوای حذفش کنی کافیه ریپلایش کنی و کلمه «del» یا «حذف» رو تایپ کنی تا از چت مخاطبت حذف بشه.\n\n" +
		"🔸 -  راهنما : /help"

	Ghavanin = "🚦🚧 قوانين استفاده از ربات هاید چت 🚧🚦\n\n" +
		"موارد زیر باعث مسدود شدن دائمی کاربر خواهد شد.\n\n" +
		"1️⃣ تبلیغات سایت ها ربات ها و کانال ها\n\n" +
		"2️⃣ ارسال هرگونه محتوای غیر اخلاقی\n\n" +
		"3️⃣ ایجاد مزاحمت برای کاربران\n\n" +
		"4️⃣ پخش شماره موبایل یا اطلاعات شخصی دیگران\n\n" +
		"5️⃣ محتوای غیر اخلاقی و یا توهین آمیز در پروفایل هاید چت\n\n" +
		"6️⃣ ثبت جنسیت اشتباه در پروفایل\n\n" +
		"7️⃣ تهدید و جا زدن خود بعنوان مدیر ربات یا پلیس فتا !\n\n" +
		"برای گزارش عدم رعایت قوانین می توانید با لمس 《 🚫 گزارش کاربر 》 در پروفایل، کاربر را گزارش کنید.\n\n" +
		"👈درصورت گزارش صحیح کاربر متخلف 💰 5 سکه بعنوان هدیه دریافت میکنید.\n\n" +
		"🔸 - راهنما : /help"

	ReStartMessage  = "شروع مجدد"
	ReConfirmFinish = "آیا مطمعن هستی؟"

	TypeGame = "با چه کسی می‌خواهید بازی کنید"

	CreateGame = "🎮 بازی %v ساخته شد\n\n" +
		"منتظر ورود دوست...\n" +
		"دوستت باید روی لینک زیر بزند تا وارد شود:\n%s"

	GameWinWithName  = "🏆 تبریک %s!\nشما برنده این بازی شدید 🎉"
	GameLoseWithName = "😔 متأسفانه %s این بازی را برد.\nدفعه بعدی جبران می‌کنید!"

	GameRepeat = "آیا می‌خواهی مجدد بازی کنی؟"

	GameActive       = "شما یک بازی فعال دارید"
	GameDooz4Started = "🎮 بازی دوز ۴تایی شروع شد!\n\n" +
		"قوانین بازی:\n" +
		"• هر بازیکنی که بتواند ۴ خانه هم‌رنگ را به صورت افقی، عمودی یا مورب کنار هم قرار دهد برنده می‌شود.\n" +
		"• مهره‌ها از پایین ستون‌ها شروع به پر شدن می‌کنند و روی هم قرار می‌گیرند.\n" +
		"💬 در طول بازی می‌توانید همینجا با دوستتان هم چت کنید."

	GameDoozClassicStarted = "🎮 بازی دوز کلاسیک شروع شد!\n\n" +
		"قوانین بازی:\n" +
		"• هر بازیکنی که بتواند ۳ خانه هم‌رنگ را به صورت افقی، عمودی یا مورب کنار هم قرار دهد برنده می‌شود.\n" +
		"💬 در طول بازی می‌توانید همینجا با دوستتان هم چت کنید."

	GameDareAndTruthStarted = "🎉 بازی جرات و حقیقت شروع شد!\n\n" +
		"روش بازی:\n" +
		"• هر بازیکن در نوبت خود یکی از دسته‌ها را انتخاب می‌کند:\n" +
		"  - جرات\n" +
		"  - حقیقت\n" +
		"  - جرات +18\n" +
		"  - حقیقت +18\n" +
		"  - شانسی\n" +
		"• بعد از انتخاب دسته، یک سؤال از همان کتگوری نمایش داده می‌شود.\n" +
		"• بازیکن مقابل باید به سؤال پاسخ دهد یا ماموریت (جرات) را انجام دهد.\n" +
		"• اگر شانسی انتخاب شود، یک دسته به صورت تصادفی انتخاب می‌شود.\n\n" +
		"💬 می‌توانید در طول بازی با هم چت کنید و نوبت‌ها را ادامه دهید."

	GameDooz4ReStarted  = `🎮 بازی دوز ۴تایی شروع شد!`
	GameEndedByYou      = "⛔️ شما بازی را به پایان رساندید.\nبازی لغو شد."
	GameEndedByOpponent = "⛔️ حریف شما بازی را به پایان رساند.\nبازی لغو شد."

	GameCancelledYou      = "🚪 بازی به پایان رسید.\nشما از بازی خارج شدید."
	GameCancelledOpponent = "🚪 بازی به پایان رسید.\nبازیکن مقابل از بازی خارج شد."

	JoinChannel = "برای استفاده از ربات ابتدا در کانال عضو شوید."

	AccessDenied = "شما دسترسی لازم را ندارید."

	YourTurn = "نوبت شماست."

	/// invite
	invite = "🎉 یک نفر از طریق لینک دعوت شما وارد شد! 10 سکه دریافت کردید."
)
