package dare_and_truth

import (
	"GapGame/internal/game/game_manager"
	"fmt"
	"math/rand"
	"strconv"
	"time"

	tele "gopkg.in/telebot.v3"
)

var categories = map[string][]string{
	"حقیقت": {
		"تا حالا در مورد چیزی دروغ گفتی که هنوز هم کسی نفهمیده؟",
		"آخرین باری که خیلی خجالت کشیدی کی بود و چرا؟",
		"اگه بتونی یکی از دوستات تو این جمع رو عوض کنی، کیو انتخاب می‌کنی و چرا؟",
		"بدترین سوتی که تو دانشگاه یا مدرسه دادی چی بوده؟",
		"آخرین چیزی که تو گوگل سرچ کردی چی بوده؟",
		"اگه قرار باشه یک روز جای یکی از افراد این جمع باشی، کی رو انتخاب می‌کنی؟",
		"تا حالا شده پیام یکی رو سین کنی و الکی بگی ندیدم؟ کی بوده؟",
		"بزرگترین ترست تو زندگی چیه که به کسی نگفتی؟",
		"اگه قرار باشه فقط یک غذا رو تا آخر عمر بخوری اون چیه؟",
		"تا حالا تو حموم دستشویی کردی؟",
		"بدترین کادویی که تا حالا گرفتی چی بوده و از کی؟",
		"اگه الان گوشیت رو بدیم دست بغل دستیت، از دیدن چیش بیشتر می‌ترسی؟",
		"چند بار تا حالا مسواک یکی دیگه رو اشتباهی زدی؟",
		"بچگانه ترین کاری که هنوزم به صورت مخفیانه انجام میدی چیه؟",
		"تا حالا شده از پارتنر یا دوست صمیمی دوستت خوشت بیاد؟",
		"بدترین دروغی که به پدر یا مادرت گفتی چی بوده؟",
		"اگه نامرئی بشی اولین کاری که می‌کنی چیه؟",
		"خزترین آهنگی که تو پلی‌لیستت داری و یواشکی گوش میدی چیه؟",
		"تا حالا شده تو جمع باد معده ول کنی و بندازی گردن یکی دیگه؟",
		"حسودترین فرد این جمع به نظرت کیه؟",
		"اگه بهت یک میلیارد تومن بدن، حاضر میشی با کدوم یکی از افراد این جمع قطع رابطه کنی؟",
		"تا حالا تو خیابون زمین خوردی که بقیه بهت بخندن؟ واکنشت چی بوده؟",
		"چیزی هست که تو این جمع کسی در موردت ندونه؟",
		"بدترین نمره‌ای که تو عمرت گرفتی چند بوده؟",
		"تا حالا از مغازه‌ای دزدی کردی (حتی در حد یک شکلات)؟",
		"اگه بگن فردا دنیا تموم میشه، امروز چیکار می‌کنی؟",
		"چه عادتی داری که خودت ازش متنفری؟",
		"تا حالا شده جلوی آینه با خودت حرف بزنی و دعوا کنی؟",
		"اولین برداشتت از بازیکنی که سمت راستت نشسته چی بود؟",
		"گران‌ترین چیزی که خریدی و بعدش به شدت پشیمون شدی چی بوده؟",
	},
	"جرات": {
		"به یکی زنگ بزن و براش یه شعر بخون!",
		"یه عکس خنده‌دار و بدون فیلتر از خودت تو استوری اینستاگرام بذار.",
		"تا ۱۰ ثانیه بدون دلیل با صدای بلند بخند!",
		"گوشیت رو بده به نفر سمت چپت تا به یک نفر از مخاطبینت پیام دلخواهش رو بفرسته.",
		"یک قاشق سس تند (یا رب گوجه) رو خالی بخور.",
		"بدون آهنگ، یک دقیقه وسط جمع برقص.",
		"برو جلوی آینه و ۳۰ ثانیه از خودت با غلو و اغراق تعریف کن.",
		"صدای سه تا حیوان رو به خنده‌دارترین شکل ممکن تقلید کن.",
		"با لهجه غلیظ (ترکی، کردی، لری، اصفهانی و...) به مدت دو دقیقه حرف بزن.",
		"تا نوبت بعدیت روی یک پا بایست.",
		"اجازه بده نفر سمت راستت با خودکار روی صورتت یه نقاشی بکشه.",
		"به آخرین کسی که بهش پیام دادی زنگ بزن و بگو «من یه راز بزرگ دارم که باید بهت بگم» و بعد قطع کن.",
		"یک لیوان آب رو بدون استفاده از دستت بخور.",
		"کفش یکی از افراد جمع رو بو کن و نظرت رو درباره بوش بگو!",
		"پنج تا شنا (پوش‌آپ) برو در حالی که یکی از بازیکن‌ها داره بلند بلند میشمره.",
		"به مدت یک دقیقه مثل یک ربات رفتار کن و حرف بزن.",
		"یک تیکه یخ رو بنداز تو لباست.",
		"با دهان پر از آب سعی کن یک آهنگ معروف رو بخونی تا بقیه حدس بزنن.",
		"تا دو دور آینده، هر حرفی میزنی باید آخرش بگی «میومیو».",
		"چشم‌هات رو ببند و با لمس کردن صورت بازیکن‌ها، حدس بزن کی هستن.",
		"به صورت تصادفی یک شماره بگیر و وقتی برداشت بگو «پیتزای شما آماده‌ست».",
		"جورابت رو دربیار و مثل دستکش دستت کن تا نوبت بعدیت.",
		"یک اعتراف شرم‌آور رو با صدای بلند تو پنجره/بالکن داد بزن.",
		"سعی کن نوک دماغت رو با زبونت لمس کنی (تا ۲۰ ثانیه تلاش کن).",
		"پروفایل واتساپت رو به یک عکس خنده‌دار که جمع انتخاب می‌کنه تغییر بده.",
		"یک پیام صوتی ۳۰ ثانیه‌ای از گریه کردن الکی خودت برای یکی از اعضای خانواده‌ت بفرست.",
		"با دست چپ (یا دستی که باهاش نمی‌نویسی) اسم خودت رو روی کاغذ بنویس.",
		"تا ۳ دقیقه آینده نباید پلک بزنی (هر بار پلک زدی یک چالش اضافه می‌گیری).",
		"یک داستان کوتاه ترسناک بساز و با صدای ترسناک برای جمع تعریف کن.",
		"یکی از اعضای جمع رو کول کن و یک دور دور اتاق بچرخ.",
	},
	"حقیقت+18": {
		"اولین عشقت کی بود؟",
		"بیشتر جذب ظاهر می‌شی یا اخلاق؟",
		"کاری کردی که از گفتنش خجالت بکشی؟",
		"عجیب‌ترین فانتزی ذهنی که تا حالا داشتی چی بوده؟",
		"جذاب‌ترین فرد تو این جمع از نظر فیزیکی کیه؟",
		"تا حالا شده تو خواب اسم کسی رو صدا بزنی که پارتنرت نبوده؟",
		"بهترین و بدترین تجربه قرار عاشقانه‌ت (Date) چی بوده؟",
		"تا حالا کسی رو فقط به خاطر پول یا موقعیتش تحمل کردی؟",
		"طولانی‌ترین رابطه‌ات چقدر طول کشیده و چرا تموم شد؟",
		"آیا تا به حال به پارتنرت خیانت کردی (حتی در حد چت کردن)؟",
		"نقطه ضعفت تو روابط عاطفی و فیزیکی چیه؟",
		"اگه قرار باشه با یکی از افراد این جمع بری تو یک جزیره متروکه، کی رو می‌بری؟",
		"خجالت‌آورترین سرچی که تو اینترنت داشتی مربوط به چی بوده؟",
		"بدترین سوتی که تو یک موقعیت رمانتیک دادی چی بوده؟",
		"کدوم قسمت از بدن خودت رو بیشتر دوست داری و کدوم قسمت از بدن جنس مخالف رو؟",
		"تا حالا شده عکسی بفرستی و بعدش از ترس پخش شدنش پشیمون بشی؟",
		"بیشترین اختلاف سنی که تو رابطه‌هات داشتی چقدر بوده؟",
		"آیا تا حالا تو مکان عمومی یا عجیب تجربه رمانتیک داشتی؟ کجا؟",
		"تا حالا با دو نفر به طور همزمان تو رابطه بودی؟",
		"خط قرمز تو تو روابط شخصی چیه که به هیچ وجه کوتاه نمیای؟",
		"اگه یک روز از خواب بیدار بشی و ببینی جنسیتت عوض شده، اولین کاری که می‌کنی چیه؟",
		"چه رفتار یا تیکه‌ای هست که فورا تو رو جذب یک نفر می‌کنه؟",
		"آیا تا حالا شده روی پدر یا مادر دوستت کراش داشته باشی؟",
		"اگه مجبور باشی یکی از افراد اینجا رو ببوسی، اون کیه؟",
		"بدترین بهانه‌ای که برای رد کردن درخواست رابطه آوردی چی بوده؟",
		"تا حالا عکس نود برای کسی فرستادی یا از کسی گرفتی؟",
		"عجیب‌ترین پیامی که تو دایرکت اینستاگرام دریافت کردی چی بوده؟",
		"چه کاری هست که تو رابطه ازت خواستن ولی رد کردی؟",
		"اگه بفهمی دوست صمیمیت به پارتنرش خیانت می‌کنه، به پارتنرش میگی؟",
		"آخرین دروغی که تو یک رابطه گفتی تا خودت رو نجات بدی چی بوده؟",
	},
	"جرات+18": {
		"از کسی که دوستش داری یه پیام غیرمنتظره و دوپهلو بفرست!",
		"ده ثانیه به کسی که تو جمع جذابت می‌دونی خیره شو بدون اینکه بخندی!",
		"یه تعریف +۱۸ و جذاب از خودت بگو!",
		"گردن نفر سمت راستت رو به مدت ۵ ثانیه ماساژ بده.",
		"برای جذاب‌ترین کانتکت تو گوشیت بنویس: «دیشب خوابتو دیدم...» و گوشیو بذار کنار.",
		"به یکی از اعضای جمع به صورت اغراق‌آمیز و هات ابراز علاقه کن.",
		"چشم‌هات رو ببند و اجازه بده یکی از بازیکن‌ها یک تکه خوراکی رو با لب‌هاش به لب‌های تو بده.",
		"یک رقص دو نفره (مثل تانگو) با یکی از اعضای جمع انجام بده.",
		"به انتخاب جمع، یکی از لباس‌های رویی‌ت (مثل سویشرت، جوراب یا کمربند) رو دربیار.",
		"یک خاطره هات و جذاب از گذشته‌ت رو برای جمع تعریف کن.",
		"روی پای نفر سمت چپت بشین تا نوبت بعدی.",
		"با یکی از افراد جمع به مدت ۳۰ ثانیه ارتباط چشمی عمیق برقرار کن.",
		"یک پیام صوتی با صدای وسوسه‌انگیز برای یکی از دوستات بفرست.",
		"دکمه بالای پیراهنت رو باز کن یا موهات رو به جذاب‌ترین شکل ممکن باز و بسته کن.",
		"اجازه بده نفر روبه‌رویی ضربان قلبت رو با دست گذاشتن روی سینه‌ت چک کنه.",
		"به انتخاب خودت، دست یکی از افراد جمع رو ببوس.",
		"یک لاف عاشقانه یا دیالوگ فیلم‌های رمانتیک رو با حس واقعی اجرا کن.",
		"به یکی از افراد جمع بگو دقیقاً چه ویژگی ظاهریش تو رو جذب می‌کنه.",
		"گوشیت رو باز کن و آخرین چتی که با پارتنرت/کراشت داشتی رو بلند بخون.",
		"یکی از بازیکن‌ها رو انتخاب کن و بهش بگو اگه با هم بودید، اولین دیت کجا می‌رفتید.",
		"به صورت نمایشی نشون بده که چطوری تو یک کلاب یا مهمونی مخ می‌زنی.",
		"یک استوری کلوزفرند بزار و بنویس «امشب خیلی تنهام» و ریپلای‌ها رو بلند بخون.",
		"به مدت یک دقیقه، با صدای آروم و توگوشی (ASMR) با نفر بغلیت حرف بزن.",
		"چشم‌بند بزن و از بوی عطر افراد جمع حدس بزن کی به کیه.",
		"یه اسکرین‌شات از هیستوری سرچ اینستاگرامت بگیر و تو گروه دوستات بفرست.",
		"ادای کسی رو دربیار که داره سعی می‌کنه خیلی جذاب به نظر برسه ولی گند می‌زنه.",
		"به آخرین پسری/دختری که تو اینستاگرام فالو کردی ریپلای بزن: «خیلی جذابی».",
		"یک گاز از سیب یا میوه‌ای که دست یکی دیگه از بازیکن‌هاست بخور.",
		"تا ۱۰ دقیقه آینده باید دست یکی از اعضای جمع رو تو دستت نگه داری.",
		"یک نقطه از بدن خودت رو که خیلی دوست داری به جمع نشون بده (در حد عرف و بازی!).",
	},
}

type GameDareTruth struct {
	LastQuestion string
}

func (g *GameDareTruth) Reset() {
	g.LastQuestion = ""
}
func (g *GameDareTruth) GameType() string {
	return "gameDareAndTruth"
}

func (g *GameDareTruth) GetRandomQuestion(category string) string {
	if category == "شانسی" {
		keys := make([]string, 0, len(categories))
		for k := range categories {
			keys = append(keys, k)
		}
		category = keys[rand.Intn(len(keys))]
	}

	questions, ok := categories[category]
	if !ok || len(questions) == 0 {
		return "سوالی برای این دسته تعریف نشده است."
	}

	return questions[rand.Intn(len(questions))]
}

func (g *GameDareTruth) MakeMove(
	b *tele.Bot,
	c tele.Context,
	keyboard *tele.ReplyMarkup,
	room *game_manager.Room,
	player *tele.User,
	category string) {

	room.LastMove = time.Now()
	if room.Turn != player.ID {
		c.Respond(&tele.CallbackResponse{
			Text: "نوبت شما نیست!",
		})
		return
	}

	var user string
	var prefix string

	if room.Turn == room.Player1.ID {
		prefix = fmt.Sprintf("%v عزیز، به سوال زیر پاسخ بده\n", room.Player2.FirstName)
		room.Turn = room.Player2.ID
		user = room.Player2.FirstName

	} else {
		prefix = fmt.Sprintf("%v عزیز، به سوال زیر پاسخ بده\n", room.Player1.FirstName)
		room.Turn = room.Player1.ID
		user = room.Player1.FirstName
	}

	msg := fmt.Sprintf("برای طرف مقابلت یک مورد را انتخاب کن \nنوبت %v ", user)

	b.Edit(&tele.StoredMessage{
		MessageID: strconv.Itoa(room.MsgID1),
		ChatID:    room.Player1.ID,
	}, msg, keyboard)

	b.Edit(&tele.StoredMessage{
		MessageID: strconv.Itoa(room.MsgID2),
		ChatID:    room.Player2.ID,
	}, msg, keyboard)

	question := g.GetRandomQuestion(category)

	question = prefix + "نوع سوال: " + (category) + "\n" + (question)

	b.Edit(&tele.StoredMessage{
		MessageID: strconv.Itoa(room.MsgID1),
		ChatID:    room.Player1.ID,
	}, question)

	b.Edit(&tele.StoredMessage{
		MessageID: strconv.Itoa(room.MsgID2),
		ChatID:    room.Player2.ID,
	}, question)

	//b.Send(room.Player2, prefix, ingamekeyboard())

}
